      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. escribir_nombre_del_programa.
       AUTHOR. Programacion_steven
       INSTALLATION. ESPECIFICAR DONDE ESTA EL PROGRAMA.
       DATE-WRITTEN.25/06/2023
       DATE-COMPILED.
       REMARKS. ESCRIBIR COMENTARIOS DEL PROGRAMA.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "HOLA MUNDO"

            STOP RUN.
       END PROGRAM escribir_nombre_del_programa.
